[
  {
    "year": "Too Long",
    "role": "Odd Jobs",
    "company": "Break Time",
    "txt": "Life threw me a curveball when my student visa expired. I had to quit programming and start working odd jobs to survive. These unexpected detours turned out to be quite valuable. As a bartender, waiter, and even construction worker, I learned a lot about people, teamwork, and problem-solving. These experiences enriched me personally and gave me a deeper understanding of the world. Though I enjoyed my new experiences, I never lost my passion for programming. I craved the challenge of algorithms, data structures, and creative problem-solving. I longed to return to the world of innovative projects, using my skills to create meaningful software solutions. As I re-immersed myself in coding, I realized that my detour had been a valuable learning experience. My odd jobs broadened my perspective and gave me a deeper understanding of the world's diversity. This newfound perspective, coupled with my renewed passion for programming, fueled my determination to re-enter the field. Today, I am ready to jump back into the world of technology, feeling confident and eager to reclaim my position as a programmer. My strong foundation in programming, coupled with my diverse experiences and unwavering determination, empowers me to face the challenges ahead. I am ready to contribute my skills and expertise to creating innovative and impactful software solutions.",
    "liveLink": "#",
    "lgPic": "job-experience-odd-jobs-lg.webp",
    "skillsUsed": ["Resiliency", "Transferable Skills", "Passion & Determination"]
  },

  {
    "year": "2008, 2009",
    "role": ".NET Programmer",
    "company": "Syncro Services",
    "txt": "For over 60 years, Syncro Services has been a pioneer in content distribution. They are putting their experience to work to maximize cloud-based content management, whether it be asset management for individual clients or the distribution of some of the most popular television shows in the world. Syncro deals with a lot of stuff, and if I recall correctly, YouTube did not exist at the time. They were delivering their content in an old-fashioned manner by mailing out a large number of DVDs and other items. So, once again, we envisioned a centralized website where clients could immediately upload and browse their media. Switching to 100% digitally stored media significantly reduced distribution expenses. Not only that, but the central website made cooperation and brainstorming on new ideas easier and virtually instantaneous. Back then, we employed cutting-edge technology, ASP.NET 2.0, in conjunction with Microsoft's Silverlight to create engaging, dynamic user experiences for Web and mobile applications. This approach enabled us to build a website that was both cost-effective and user-friendly. We were able to quickly respond to customer feedback and evolve our product. The website was a great success, and we were able to expand our customer base significantly.",
    "liveLink": "https://www.xr.global/",
    "lgPic": "job-experience-syncro-lg.webp",
    "skillsUsed": ["Creativity and Innovation", "Cost Reduction", "Back-End Web Development", "Databases", "Multimedia", "Silverlight"]
  },

  {
    "year": "2005 — 2007",
    "role": "Web Consultant",
    "company": "Not For Tourists",
    "txt": "The Not For Tourists Guide to New York City is a map-based, neighborhood-by-neighborhood dream guide designed to lighten the load of already street-savvy New Yorkers, commuters, business travelers, and, yes, tourists too. I was hired as a web consultant to assist in the implementation of a more centralized and database-driven content management system. So that multiple editors with varying levels of access might simply modify their guidelines from a single central database. I created the main website as well as the CMS, which would automatically sync with the most recent modifications. This would allow a traveling editor to simply contribute, add, or amend any landmark, restaurant, bar, or store that would subsequently appear in the guide's final book version. We even tried implementing automatic page layout in InDesign by linking it straight to the central database. The CMS also allowed for the automatic generation of an interactive map with hotspots and interactive tooltips, allowing for a more interactive user experience. We also implemented a search feature, allowing users to quickly find any landmark, restaurant, bar, or store within the guide.",
    "liveLink": "https://www.notfortourists.com/",
    "lgPic": "job-experience-notfortourists-lg.webp",
    "skillsUsed": ["Online Consultancy", "Database Design", "Content Management Systems (CMS)", "Web Applications"]
  },

  {
    "year": "2002 — 2004",
    "role": "Full-Stack Developer",
    "company": "DanceShopper",
    "txt": "We met at the ALCC English School in New York, where you get a chance to meet people from all over the world. He was originally from Taiwan, was really interested in technology and e-commerce, and had this brilliant idea to sell items for professional dancers online. How could you possibly sell shoes online if clients could not physically try them on? Professional dancing, on the other hand, is a nice and specific niche where dancers know exactly what they need and order their shoes frequently before every major competition. Those shoes take a lot of abuse and must be updated frequently. So, since I already had some expertise with ASP.NET and C#, I decided to assist him in realizing his vision. We took inspiration from other websites on the Internet and created an e-commerce website from the ground up, including the SQL Server database for the back end and VeriSign for credit card processing. We also implemented a content management system for updating the products, and an analytics system for tracking user behavior. The website was launched on time and was well-received by the customers.",
    "liveLink": "https://www.danceshopper.com/",
    "lgPic": "job-experience-danceshopper-lg.webp",
    "skillsUsed": ["ASP.NET", "C#", "Microsoft SQL Server", "Web Design", "E-Commerce"]
  }
]
