[
  {
    "/": {
      "eyebrow": "Umiejętności i Doświadczenie",
      "heading": "Moje CV",
      "intro": "Kiedyś zajmowałem się ASP.NET i C#, ale moja pasja do tworzenia stron internetowych nigdy nie osłabła. Obecnie jestem całkowicie uzależniony od React, JavaScript, HTML i CSS – idealnych narzędzi do realizacji mojej obsesji na punkcie programowania front-end. Z nienasyconym głodem wiedzy i zaangażowaniem w naukę, poszukuję możliwości odbycia stażu, aby ubrudzić sobie ręce i przyczynić się do każdego projektu, który stanie mi na drodze. Nawet najprostsze zadania dostarczyłyby bezcennych doświadczeń edukacyjnych, ponieważ staram się podnieść swoje umiejętności tworzenia stron internetowych na wyższy poziom. Chętnie chłonę wiedzę od doświadczonych profesjonalistów i współpracuję z zespołem błyskotliwych umysłów. Jestem gotów przyswajać umiejętności i spostrzeżenia, tak aby stać się prawdziwym atutem każdego zespołu."
    },

    "/education": {
      "eyebrow": "Programista z Dyplomem „Media Interaktywne”",
      "heading": "Moja Edukacja",
      "intro": "Moja podróż edukacyjna rozpoczęła się na Politechnice Rzeszowskiej, gdzie zetknąłem się ze światem informatyki. Zanim zdecydowałem się przenieść do Instytutu Pratta w Stanach Zjednoczonych, spędziłem dwa lata na zgłębianiu podstaw i tajników informatyki. W Pratt od razu zaangażowałem się w program „Media Interaktywne”, poznając wszystkie najnowsze trendy w tworzeniu, projektowaniu i obsłudze stron internetowych. Mimo, że nie mam prestiżowego tytułu magistra, to zbudowałem mocne i solidne podstawy wiedzy. Biegle posługuję się także różnymi językami programowania i technologiami, w tym JavaScript, HTML, CSS i React. Jestem osobą pracowitą, zawsze chętną do nauki i rozwoju. Dodatkowo jestem duszą towarzystwa, zawsze chętną do współpracy z utalentowanymi ludźmi i chłonięcia kreatywnej wiedzy. Jestem pewien, że moja pasja, umiejętności i chęć uczenia się czynią mnie cennym nabytkiem dla każdej organizacji, która chce dać mi szansę zabłysnąć."
    },

    "/contact": {
      "eyebrow": "Nawiążmy Kontakt",
      "heading": "Skontaktuj się ze mną",
      "intro": "Odezwij się! Niezależnie od tego, czy masz pytanie dotyczące mojej pracy, jesteś zainteresowany współpracą przy projekcie, czy też zastanawiasz się nad stażem dla mnie, nie wahaj się i skontaktuj się! Skorzystaj z poniższego formularza, aby wysłać mi wiadomość, a ja z przyjemnością odpowiem niezwłocznie. Chętnie nawiązuję nowe kontakty, tak aby uczyć się i rozwijać wspólnie z Tobą! Pozdrawiam i mam nadzieję do usłyszenia wkrótce!"
    }
  },

  {
    "/": {
      "eyebrow": "Kuźnia Full-Stack",
      "heading": "Moje CV",
      "intro": "Moja podróż rozpoczęła się od ASP.NET i C#, ale teraz prosperuję w świecie Full-Stack. JavaScript to mój ulubiony język. Korzystam z React, NextJS i klasycznego trio twórców stron internetowych (HTML, CSS i JS), aby tworzyć wyjątkowe doświadczenia. NextJS pozwala mi wypełnić lukę pomiędzy front-endem a backendem, tworząc wydajne i przyjazne dla SEO aplikacje internetowe. Mój głód wiedzy jest nienasycony i chętnie podejmę staż, podczas którego będę mógł wykorzystać moje umiejętności zarówno front-endowe, jak i backendowe. Każdy projekt, duży czy mały, jest szansą na naukę i rozwój. Szybko się uczę i jestem chętny do współpracy z fajnym zespołem oraz chłonięcia wiedzy od doświadczonych programistów. Mój cel? Stać się prawdziwym atutem, przynosząc do stołu pełen zestaw umiejętności, świeże perspektywy i głód wiedzy."
    },

    "/education": {
      "eyebrow": "Budowanie Mostów: od Podstaw do Projektowania Interaktywnego",
      "heading": "Moja Edukacja",
      "intro": "Moja droga edukacji rozpoczęła się od podstaw informatyki na Politechnice Rzeszowskiej. Po dwóch latach zapragnąłem głębiej zanurzyć się w kreatywną stronę rozwoju. Podjąłem więc odważny krok i przeniosłem się do programu „Media Interaktywne” Instytutu Pratt w USA. Pratt rozpalił moją pasję do tworzenia stron internetowych, łącząc projektowanie, wygodę użytkownika i najnowsze technologie internetowe. Chociaż mój dyplom może nie dotyczyć tradycyjnego CS (informatyki), dobrze rozumiem podstawowe koncepcje programowania. Moje umiejętności obejmują JavaScript, HTML, CSS i React i stale poszerzam swoją wiedzę. Ta podróż odzwierciedla moje zaangażowanie i pragnienie nauki. Dobrze odnajduję się w środowisku współpracy, czerpiąc wiedzę od utalentowanych członków zespołu. Moja pasja w połączeniu z umiejętnościami i chęcią rozwoju sprawia, że ​​jestem cennym nabytkiem dla każdego zespołu poszukującego pomostu pomiędzy silnym zrozumieniem technicznym a kreatywnym rozwiązywaniem problemów."
    },

    "/contact": {
      "eyebrow": "Stwórzmy Razem Coś Niesamowitego!",
      "heading": "Skontaktuj się ze mną",
      "intro": "Niezależnie od tego, czy interesuje Cię projekt, nad którym pracowałem, masz pytanie związane z tworzeniem stron internetowych, czy też szukasz stażysty z pasją i entuzjazmem do swojego zespołu, z chęcią Cię wysłucham! Naprawdę wierzę, że współpraca napędza innowacje. Jeśli więc masz pomysł, który chcesz wcielić w życie lub po prostu chcesz porozmawiać o stale rozwijającym się świecie tworzenia stron internetowych, nie wahaj się! Skontaktuj się ze mną za pomocą poniższego formularza i pozwól mi Cię usłyszeć. Szybko się uczę i mam prawdziwy entuzjazm w tej dziedzinie. Zawsze poszukuję możliwości poszerzenia swojej wiedzy i wzięcia udziału w znaczących projektach. Poza tym mocno wierzę w siłę dobrej rozmowy, bo to właśnie z niej rodzą się najfajniejsze pomysły! Dlatego śmiało zadawaj pytania i podsuwaj pomysły na projekty lub staże. Nie mogę się doczekać, aby usłyszeć od Ciebie i wyruszyć razem w twórczą podróż!"
    }
  },

  {
    "/": {
      "eyebrow": "JavaScript Jedi: od Front-Endu do Full-Stack",
      "heading": "Moje CV",
      "intro": "Dawno, dawno temu... zajmowałem się kodem ASP.NET i C#. Ale Moc (czyli JavaScript) obudziła się we mnie, prowadząc mnie na ścieżkę Front-Endu. Teraz, dzierżąc miecze świetlne React, NextJS, HTML i CSS, tworzę doświadczenia użytkowników, które wzbudzają podziw. Moja nienasycona ciekawość zmusza mnie do zgłębiania głębin Mocy – zarówno front-endu, jak i backendu. Nadchodzi staż i szansa na uwolnienie mojego pełnego potencjału w środowisku współpracy. Każdy projekt i nowa przygoda napędza mój rozwój jako programisty. Szybko się uczę i chętnie chłonę wiedzę od mądrych Mistrzów (doświadczonych developerów!), dążę do tego, aby stać się prawdziwym atutem każdego zespołu. Świeże perspektywy i głód wiedzy to moja ulubiona broń, jestem gotów dołączyć do Rebelii (Twojego niesamowitego zespołu!) i podbić cyfrową galaktykę (tworząc niesamowite aplikacje internetowe!)."
    },

    "/education": {
      "eyebrow": "Rekrut Rebelii: od Podstawowych Protokołów do UX",
      "heading": "Moja Edukacja",
      "intro": "Moja podróż rozpoczęła się na znanym terenie informatyki na Politechnice Rzeszowskiej. Po dwóch latach poczułem zew Rebelii – potrzebę odkrywania twórczej strony Mocy (czyli tworzenia stron internetowych). Dokonałem więc śmiałego skoku w nadprzestrzeń, przenosząc się do prestiżowego programu Interactive Media do Pratt Institute w USA. Pratt otworzył mi oczy na potęgę Mocy w tworzeniu stron internetowych. Tutaj nauczyłem się władać mieczami świetlnymi projektowania, UX i innych technologii internetowych. Mój dyplom może nie jest tradycyjnym certyfikatem Jedi (informatyka), ale mam mocne podstawy w językach programowania – droidach świata programistów (JavaScript, HTML, CSS i React). A moje treningi trwają! Ta ścieżka odzwierciedla moje niezachwiane poświęcenie i głód wiedzy. Dobrze radzę sobie w środowiskach współpracy, chętnie uczę się od doświadczonych programistów (Mistrzów Jedi!). Moja pasja w połączeniu z umiejętnościami i nieustannym dążeniem do rozwoju czyni mnie cennym nabytkiem dla każdego zespołu poszukującego Rebelianta ze znajomością protokołów technicznych i talentem do kreatywnego rozwiązywania problemów."
    },

    "/contact": {
      "eyebrow": "Wyraź Swój Wewnętrzny Bunt: Zbudujmy coś Epickiego!",
      "heading": "Skontaktuj się ze mną",
      "intro": "Czy kiedykolwiek czułeś, że Moc wzywa Cię do przyłączenia się do walki o jeszcze bardziej niesamowite doświadczenia w sieci? Niezależnie od tego, czy masz palące pytanie dotyczące projektu z mojego portfolio, śmiałą wizję nowej aplikacji internetowej, czy też szukasz utalentowanego stażysty, który dołączy do Twojego zespołu programistów Jedi, to jest Twoja szansa na wysłanie transmisji! Pamiętajcie, że Rebelia rozwija się dzięki współpracy. Jeśli więc masz projekt wielkości Gwiazdy Śmierci i potrzebujesz wykwalifikowanego programisty lub po prostu chcesz porozmawiać o najnowszych osiągnięciach w tworzeniu stron internetowych, których pozazdroszczą nawet R2-D2, nie wahaj się skontaktować! Wypełnij poniższy formularz i połączmy wspólne siły. Moje umiejętności są ostre jak miecz świetlny, a mój głód wiedzy jest wszechobecny, niczym uparty droid. Chętnie wniosę swój wkład w znaczący projekt i skorzystam z mądrości doświadczonych programistów (Mistrzów Jedi!). Poza tym, kto wie? Nasza rozmowa może zaowocować kolejnym rewolucyjnym pomysłem, który na zawsze zmieni sieć, podobnie jak skradzione plany Gwiazdy Śmierci! Dlatego śmiało ślij pytania, pomysły na projekty lub zapytania o staże. Niech Moc będzie z Tobą i z niecierpliwością czekam na Twoją transmisję!"
    }
  }
]
